Repository: Giovani-O/barber-boss-api
Catalog: src/BarberBoss.Exception/ResourceErrorMessages.*.resx
Languages: pt_br

source: Unknown error
pt_br: Erro desconhecido

# NAME_EMPTY
source: The name cannot be empty
pt_br: O nome não pode estar vazio

# NAME_TOO_LONG
source: The name is too long
pt_br: O nome é muito comprido

# EMAIL_EMPTY
source: The email cannot be empty
pt_br: O email não pode estar vazio

# EMAIL_INVALID
source: This email is invalid
pt_br: Este email é inválido

# EMAIL_TOO_LONG
source: The email is too long
pt_br: Este email é muito longo

# PASSWORD_INVALID
source: The password is invalid
pt_br: A senha é inválida

# PASSWORD_TOO_LONG
source: The password is too long
pt_br: A senha é muito longa

# PASSWORD_TOO_SHORT
source: The password is too short
pt_br: A senha é muito curta

# EMAIL_ALREADY_EXISTS
source: This email is already in use
pt_br: Este email já está em uso

# ID_IS_INVALID
source: The Id is invalid
pt_br: O Id é inválido

source: User not found
pt_br: Usuário não encontrado

# BARBER_SHOP_WITH_THIS_NAME_ALREADY_EXISTS
source: A barber shop with this name already exists
pt_br: Já existe uma barbearia com esse nome

# ID_IS_EMPTY
source: The Id cannot be empty
pt_br: O Id não pode ser vazio

# BARBER_SHOPS_NOT_FOUND
source: No barber shops were found for this user
pt_br: Nenhuma barbearia encontrada para esse usuário

# BARBER_SHOP_NOT_FOUND
source: The specified barber shop wasn't found
pt_br: A barbearia especificada não foi encontrada
